{
  "views": {
    "getBack": "Back",
    "sendSuccess": "Sent succesfully!",
    "sendError": "Send has failed.",
    "components": {
      "navBar": {
        "menu": {
          "about": "About us",
          "analyze": "Analyze Linker",
          "design": "Design Linker",
          "results": "See Results",
          "contact": "Contact us"
        }
      },
      "fastaUploader": {
        "title": "Drag and drop to upload .fasta file!",
        "subtitle": "...or click to select a .fasta file from your computer"
      },
      "fastaValidator": {
        "title": "Fasta file visualization",
        "subtitle": "Once you choose a fasta file you will see in this box the selected\n      sequence, it's name and also it's length. <br />\n      For <strong>flanking sequences</strong> you will see as highlighted the\n      part that will be taken into account for the analysis.",
        "successfulMessageTitle": "Well done! This is a valid fasta file",
        "errorMessageTitle": "Oops! This is not a valid fasta file",
        "labelName": "Name:",
        "labelSequence": "Sequence:",
        "labelLength": "Lenght:",
        "labelTakenLength": "Taken Length:",
        "labelSuggetionsTitle": "Please check out the following suggestions:",
        "labelSuggetion1": "Only files are allowed: ",
        "labelSuggetion2": "The file should not be empty.",
        "labelSuggetion3": "All comments should start with \">\" character.",
        "labelSuggetion4": "Outside a comment, the only allowed characters are:",
        "labelSuggetion5": "Your file contains forbidden characters."
      },
      "results": {
        "DesignResult": {
          "title": "Design Result"
        },
        "DesignResultHistory": {
          "title": "Mutation history",
          "headers": {
            "Pos": "Pos",
            "Before": "Before",
            "After": "After",
            "Score": "Score"
          }
        },
        "DesignResultSummary": {
          "headers": {
            "Initial": "Initial sequence ",
            "Final": "Final sequence ",
            "Copy": "Copy",
            "Copied": "Copied!",
            "ErrorMessage": "Sorry, unable to copy to clipboard.",
            "Length": "Length"
          }
        }
      }
    },
    "home": {
      "welcomeMessage": "Welcome to Patena!",
      "welcomeDescription": "The tool allows to perform on the sequences to detect desired and undesired characteristics during the \n iterative design process. It is explained in general what is the objective of applying each \n none of the methods and the fundamentals in which The details of how the different resources are integrated in the context of our application are presented, representing their results in the scoring scheme of our method. \n \nThe set of evaluations described corresponds to this first version of our Therefore, it does not represent an exhaustive or final set, but rather a first stage that should be analyzed and modified in a logical way according to the results obtained.",
      "moreMessage": "To know in more details about the process, click the button below",
      "seeMore": "Learn More"
    },
    "about": {
      "title": "About us",
      "description": "The Patena Community is a group formed by two institutions: The University of Buenos Aires, the University of La Plata. \n \nWho work here we do it guided by the principles and values that our founder transmitted to us, and mobilized for the only transcendent purpose that marks the direction of our Institutions. "
    },
    "notFound": {
      "title": "404 - Page not found",
      "description": "The page you requested could not be found. Is there any chance you were looking for one of these?",
      "getResult": "Check the result of an analysis or design",
      "design": "Design a new Linker",
      "analyze": "Analyze your own Linker"
    },
    "contact": {
      "title": "Contact us",
      "name": "Full Name",
      "mail": "Email",
      "message": "Your message",
      "send": "Send",
      "errorMail": "The email field must be a valid email"
    },
    "result": {
      "title": "View Result",
      "label": "Enter your order number to continue",
      "placeholder": "Order number",
      "help": "Example: 550e8400-e29b-41d4-a716-446655440000",
      "btnSearch": "Search",
      "btnFailed": "Search (failed)",
      "btnUnknown": "Search (invalid order number)",
      "unknownOrderNumber": "The requested order number was not found. Please try another one.",
      "cancelledOrderNumber": "Your order has been cancelled.",
      "inActionOrderNumber": "Your order is being processed right now. Results will be ready very soon.",
      "pendingOrderNumber": "it is in the pending queue.",
      "unknownOrderNumberHeader": "Are you sure it is correct?",
      "cancelledOrderNumberHeader": "Sorry, on several occasions your order ended with errors.",
      "inActionOrderNumberHeader": "Little time left to finish!",
      "pendingOrderNumberHeader": "Your order has not yet been processed"
    },
    "download": {
      "title": "Download Result",
      "subtitle": "Result",
      "report": "Order number:",
      "btnDownload": "Download"
    },
    "analyze": {
      "title": "Analyze Linker",
      "placeholder": "Enter your file .fasta",
      "mail": "Mail",
      "btnSearch": "Search",
      "btnAnalyze": "Analyze"
    },
    "analyzeSuccess": {
      "title": "Analyze Linker",
      "alertTitle": "Well done!",
      "fileReceived": "We have successfully received your file ",
      "emailSent": "In addition we just sent an email to ",
      "emailNotSent": " The assigned order number was ",
      "orderNumber": "with the following order number ",
      "notify": "When your request is done you will received a notification email in order to see the results.",
      "suggestion": "We strongly recommend to keep this order number and we thank you for using PATENA"
    },
    "design": {
      "title": "Design a linker",
      "stStep": "What would you like to design ?",
      "ndStepLength": "Length calculation",
      "ndStepSequence": "What starting data do you have?",
      "ndStepSequenceNothing": "Nothing",
      "ndStepSequenceIS": "Initial Sequence",
      "ndStepSequenceFS": "Flanking Sequences",
      "ndStepSequenceISFS": "Initial Sequence and Flanking Sequences",
      "rdStepNothing": "Which is the distance between the amino acid do you want to link ?",
      "rdStepAlertNothing": "By not having an initial sequence the system will assign a random sequence",
      "rdStepIS": "Which is your initial sequence ?",
      "rdStepFS": "Which are your flanking sequences ?",
      "rdStepDistanceFS": "Distance",
      "rdStepCalculatedLength": "Calculated length",
      "rdStepISFS": "Which are your flanking and initial sequences?",
      "rdStepLabelFS1": "Flanking sequence 1",
      "rdStepLabelFS2": "Flanking sequence 2",
      "rdStepLabelIS": "Initial sequence",
      "label": "Length calculation",
      "placeholder": "Enter the distance",
      "btnLinkerLength": "Linker Length",
      "btnLinkerSequence": "Linker Sequence",
      "next": "Next",
      "noInitialSequence": "-none-",
      "breadcrumb": {
        "step1": "Design choice",
        "step2LinkerLength": "Linker length",
        "step2InitialData": "Initial data choice",
        "step3": "Data loading",
        "step4": "Patena's settings"
      }
    },
    "patenaSettings": {
      "title": "Which Patena's settings do you prefer?",
      "useDefaultSettings": "Use default settings",
      "useCustomSettings": "Use custom settings",
      "aminoAcidFrequencies": "Amino acid's frequency",
      "netCharge": "Net Charge",
      "selectNetCharge": "Select within the range a value for net charge",
      "algorithms": "Algorithms",
      "important": "Attention please: ",
      "aminoAcidWarning": "Take into account that all frequencies must sum 100% together",
      "totalFrequency": "Total frequency",
      "restoreFrequencies": "Restore default frequencies",
      "references": "References",
      "uvAminoAcidLabel": "Amino acids that absorb UV",
      "CLabel": "Cysteine",
      "actions": "Actions",
      "avoidAminoAcid": "Avoid UV amino acids",
      "avoidCysteine": "Avoid Cysteine",
      "netChargeWarning": "Net charge could be zero, a postive or negative integer and it's module could not be higher than the sequence length.",
      "netCharge": "Net charge (optional)",
      "netChargePlaceholder": "Enter net charge",
      "algorithmWarning": "At least one algorithm should remain active. Take into account that some algorithms would require some time to work.",
      "labelCheckNetCharge": "I want to select a specific net charge",
      "descriptionBlast": "The BLAST method allows to evaluate the similarity between two sequences\nbiological, such as chains of amino acids corresponding to proteins or nucleotide sequences. In our tool we will use BLAST to infer the\nexistence of functional elements in the linker sequence that we are evaluating at\nfrom a considerable similarity with natural sequences, which we assume\nthat possess a biological functionality.",
      "descriptionIUPred": "The IUPred tool allows differentiating those sequences that can\nform enough favorable interactions between their residues, and thus could\nfold into a globular structure, of which they do not have this capacity and, in case\nalone, they remain in a disordered conformation. This difference allows us,\nwithin our method, identify the positions of the evaluated sequence that\nhave a greater tendency to form globular conformations, a property that\nwe describe as unwanted for linker sequences",
      "descriptionTMHMM": "Membrane proteins are protein modules with sequential properties\ndistinctive and that, despite their difference from globular proteins, can adopt a certain three-dimensional structure, stabilized by interactions with\nthe hydrophobic context in which they are normally found. Taking into account\nthis bigger picture, we use the TMHMM predictor to identify,\nwithin the sequence we are evaluating, transmembrane segments since\nthey have probably not been detected by other methods of our evaluation.",
      "descriptionTango": "TANGO is a method used mainly to predict regions of\nβ aggregation, developed from a statistical mechanics model that defines\na phase space including, in addition to these aggregates, conformations of βturn, α-helices and β-strands. In our evaluation system, we want to avoid both\nthe aggregate conformations like any other ordered structure, thus\nWe will use TANGO to detect positions that tend to meet\nforming any of these conformations.",
      "descriptionPASTA": "In our tool, we use PASTA to identify which are the\nregions within the sequence we are evaluating that could stabilize a\namyloid fibril structure. To make this prediction, the method performs a\ncalculation of the interaction energies between the different segments, assuming that the\nThe mechanism of interactions between amino acids that leads to the formation of β-sheets in globular proteins is the same that leads to the formation of stacks of\nβ-strands in amyloid fibrils",
      "descriptionWaltz": "We use Waltz within the evaluations of our tool to\npredict the tendency of the sequence to form amyloid aggregates. Specifically, the Waltz method determines the tendency to form amyloid aggregates based on\nthree contributions: a component derived from sequential information, a component derived from a set of 19 physicochemical properties, and a component\nresulting from evaluating different residues on a structural model of the chain\ncarbonate of amyloid fibers.",
      "descriptionProsite": "PROSITE is a resource that groups together a large number of sequential motifs of various characteristics, making it possible to annotate and identify conserved regions in protein sequences. In our implementation we use this resource\nto extend the search for functional elements in the sequence.",
      "descriptionELM": "The eukaryotic linear motif (ELM) resource was established with the\nmission to collect, annotate and classify short linear motifs (known as LMs,\nELMs, SLiMs or MiniMotifs.We will use it to\ndetect instances of these elements within the linker sequence that we are\nevaluating, something that, due to the intrinsic properties of SLiMs, would not be\npossible without a resource with manually curated data from the literature and that are\ncompletely available to the scientific community, such as ELM.",
      "descriptionLimbo": "The Limbo method is a predictor of DnaK chaperone binding sites,\nrepresentative of the extensive Hsp70 family, which specializes in the binding of exposed hydrophobic regions, generally present in unfolded polypeptides. The\nbinding of chaperones to a sequence governs a great variety of processes such\nas translocation, refolding and degradation of the recognized protein, in addition\nof the activation of a wide range of associated proteins. The goal of applying\nThis tool in our evaluation scheme is to detect the presence of sites of\nbinding to chaperones in the linker sequence, avoiding recognition and interaction\nwith proteins in the biological system of expression or application.",
      "descriptionANCHOR": "The ANCHOR tool seeks to identify a special class of segments\ndisordered that are capable of undergoing a binding & folding process, typical of binding to a globular protein. The objective of applying this tool as\nPart of our evaluation is mainly due to the fact that these molecular recognition processes are usually associated with the signaling of different processes\nbiological, something that we highlight as negative for a linker since it could affect\nthe normal functioning of the biological system in which it is found. In this way, we try to detect which are the positions that make up these elements in\nthe sequence we are evaluating.",
      "descriptionAmyloidPattern": "In this stage of the evaluation we will use a sequential pattern extracted from\nstarting from experimental evaluations in order to find determinants\nsequential for the formation of amyloid fibrils on the linker sequence that\nwe are evaluating.\nThe work done to obtain the sequential pattern that determines the formation\nof amyloid fibrils is based on a mutagenesis experiment from a\nde novo designed amyloid fibril-forming peptide."
    },
    "designLengthSuccess": {
      "title": "Design a linker length",
      "length": "The required length is:",
      "suggestion": "Thank you for using PATENA",
      "lengthUnit": " amino acid"
    },
    "designSuccess": {
      "title": "Design a linker",
      "alertTitle": "Well done!",
      "dataReceived": "We have successfully received your information",
      "emailSent": "In addition we just sent an email to ",
      "emailNotSent": " The assigned order number was",
      "orderNumber": "with the following order number ",
      "notify": "When your request is done you will received a notification email in order to see the results.",
      "suggestion": "We strongly recommend to keep this order number and we thank you for using PATENA"
    },
    "confirmationModal": {
      "title": "Confirm your information",
      "operation": "Operation",
      "initialSequence": "Initial sequence",
      "flankingSequence1": "Flanking sequence 1",
      "flankingSequence2": "Flanking sequence 2",
      "sequence": "Sequence",
      "distance": "Distance",
      "email": "Email",
      "btnCancel": "Cancel",
      "btnConfirm": "Confirm"
    },
    "footer": {
      "uba": "Is a public research university in Buenos Aires, Argentina. Established in 1821, it is the main institution of higher education in the country and in 2020 it was considered the most prestigious university in Latin America.",
      "contactInfo": "Main Offices",
      "usefulLinks": "Useful Links",
      "ourLab": "Our laboratory",
      "blast": "What is BLAST?",
      "navigation": "Navigation"
    }
  }
}
