{
  "views": {
    "getBack": "Volver",
    "sendSuccess": "Envío correcto!",
    "sendError": "El envío ha fallado.",
    "components": {
      "navBar": {
        "menu": {
          "about": "Nosotros",
          "analyze": "Analizar Linker",
          "design": "Diseñar Linker",
          "results": "Ver Resultados",
          "contact": "Contacto"
        }
      },
      "fastaUploader": {
        "title": "Arrastre su archivo .fasta aquí!",
        "subtitle": "...o haga click para seleccionar un archivo .fasta desde su ordenador."
      },
      "fastaValidator": {
        "title": "Vista Previa",
        "subtitle": "Una vez que elija un archivo fasta, verá en esta casilla la secuencia seleccionada, su nombre y también su longitud.\nPara las secuencias de flanqueo, verá como resaltada la parte que se tendrá en cuenta para el análisis.",
        "successfulMessageTitle": "Bien Hecho!  Archivo fasta correcto",
        "errorMessageTitle": "Algo ha salido mal! Archivo fasta no es correcto",
        "labelName": "Nombre:",
        "labelSequence": "Secuencia:",
        "labelLength": "Longitud:",
        "labelTakenLength": "Longitud considerada:",
        "labelSuggetionsTitle": "Por favor revisa las siguientes sugerencias:",
        "labelSuggetion1": "Solo se permiten archivos",
        "labelSuggetion2": "El archivo no debe estar vacío.",
        "labelSuggetion3": "Todos los comentarios deben comenzar con el carácter \">\".",
        "labelSuggetion4": "Fuera de un comentario, los únicos caracteres permitidos son: A R N D C E Q G H I L K M F P S T W Y V",
        "labelSuggetion5": "Su archivo contiene caracteres prohibidos."
      },
      "results": {
        "DesignResult": {
          "title": "Resultado del Diseño"
        },
        "DesignResultHistory": {
          "title": "Historial de mutaciones",
          "noMutation": "No fue necesario realizar ninguna mutación.",
          "headers": {
            "Pos": "Pos",
            "Before": "Antes",
            "After": "Después",
            "Score": "Score"
          }
        },
        "DesignResultSummary": {
          "headers": {
            "Initial": "Secuencia inicial ",
            "Final": "Secuencia final",
            "Copy": "Copiar",
            "Copied": "Copiado!",
            "ErrorMessage": "Lo sentimos, no se puede copiar al portapapeles.",
            "Length": "Longitud"
          }
        }
      }
    },
    "home": {
      "welcomeMessage": "¡Bienvenido a Patena!",
      "welcomeDescription": "La herramienta permite realizar sobre las secuencias para detectar caracteŕısticas deseadas y no deseadas durante el\nproceso iterativo de diseno. Se explica en general cúal es el objetivo de aplicar cada\nuno de los ḿetodos y los fundamentos en los que se basan. Se detalla ćomo se\nintegran los distintos recursos en el contexto de nuestra aplicaci ́on, representando\nsus resultados en el esquema de puntajes propio de nuestro ḿetodo.\n\nEl conjunto de evaluaciones que se describen corresponde a esta primera versíon de nuestra herramienta. Por lo tanto no representa un conjunto exhaustivo ni\ndefinitivo, sino una primera etapa que deber ́a ser analizada y modificada de forma\niterativa en funcíon de los resultados obtenidos.",
      "moreMessage": "Para conocer en mejor detalle la herramienta, siga el siguiente boton",
      "seeMore": "Saber más"
    },
    "about": {
      "title": "Quiénes  Somos",
      "description": "La Comunidad Patena es un grupo formado por dos instituciones: La Universidad de Buenos Aires, la Universidad de la Plata.\n\nQuienes trabajamos aquí lo hacemos guiados por los principios y valores que nos transmitió nuestro fundador, y movilizados por la única finalidad trascendente que marca el rumbo de nuestras Instituciones.",
      "personOneName": "Dr. Ignacio E. Sánchez",
      "personOneDescription": "Investigador que co-organiza cursos en Biología\n            sintética y es \"Profesor Adjunto\" en la UADE, para la materia Biología de Sistemas en la Licenciatura en bioinformática. También fue \"Jefe de trabajos prácticos\" en las materias \"Química Biológica I\" y \"Química Biológica IIB\" del Departamento de Química Biológica (FCEyN, Universidad de Buenos Aires)",
      "personTwoName": "Dr. Diego U. Ferreiro",
      "personTwoDescription": "Profesor Adjunto en el Departamento de Química\n              Biológica (FCEyN, Universidad de Buenos Aires), en la materia \"Bioquímica Avanzada\". Forma parte del Departamento de Química Biológica IQUIBICEN\n              Facultad de Ciencias Exactas y Naturales.\n              También fue \"Jefe de trabajos prácticos\" en el Departamento de Fisiología y Biología Molecular y Celular (FCEyN, Universidad de Buenos Aires).",
      "personThreeName": "Lic. Ignacio Eguinoa",
      "personThreeDescription": "Analista programador egresado de la Universidad Nacional de\n            La Plata. Uno de los principales colabores del proyecto Patena con el fruto de su tesis\n              titulada \"Implementación de una\n            herramienta bioinformática para el\n            diseño de secuencias linker\" dando como resultado el componente fundamental de Patena.\n              La misma fue finalizada en el año 2015 y\n              dirigida por Dr. Ignacio E. Sánchez"
    },
    "notFound": {
      "title": "404 - Página no encontrada",
      "description": "No hemos podido encontrar la dirección requerida. Quizás haya querido acceder a?",
      "getResult": "Chequear el resultado de su diseño",
      "design": "Diseñar un nuevo Linker",
      "analyze": "Analizar su propio Linker"
    },
    "contact": {
      "title": "Contacto",
      "name": "Nombre Completo",
      "mail": "Correo Electronico",
      "message": "Su Mensaje",
      "send": "Enviar",
      "errorMail": "El campo de correo electrónico debe ser un correo electrónico válido"
    },
    "result": {
      "title": "Ver Resultado",
      "label": "Ingrese su número de orden para continuar",
      "placeholder": "Número de orden",
      "help": "Ejemplo: 550e8400-e29b-41d4-a716-446655440000",
      "btnSearch": "Buscar",
      "btnFailed": "Buscar (fallando)",
      "btnUnknown": "Buscar (número de orden inválido)",
      "unknownOrderNumber": "El número de orden solicitado no fue encontrado. Intente con otro por favor.",
      "cancelledOrderNumber": "Su pedido fue cancelado .",
      "inActionOrderNumber": "En este momento su pedido se encuentra en ejecución. Los resultados estarán listos muy pronto.",
      "pendingOrderNumber": "el mismo encuentra en la cola de pendientes",
      "unknownOrderNumberHeader": "¿Estás seguro que está correcto?",
      "cancelledOrderNumberHeader": "Lo sentimos, en varias ocaciones tu pedido finalizó con errores",
      "inActionOrderNumberHeader": "Queda poco tiempo para terminar!",
      "pendingOrderNumberHeader": "Su pedido aún no ha sido procesado"
    },
    "download": {
      "title": "Descargar Resultado",
      "subtitle": "Resultado",
      "report": "Número de orden:",
      "btnDownload": "Descargar"
    },
    "analyze": {
      "title": "Analizar Linker",
      "placeholder": "Elija su archivo .fasta",
      "mail": "Correo Electronico",
      "btnSearch": "Buscar",
      "btnAnalyze": "Analizar"
    },
    "analyzeSuccess": {
      "title": "Analizar Linker",
      "alertTitle": "¡Bien hecho!",
      "fileReceived": "Hemos recibido correctamente su archivo ",
      "emailSent": "Le comentamos también que hemos enviado un mail a ",
      "emailNotSent": " El número de orden asignado fue ",
      "orderNumber": "con el siguiente número de orden ",
      "notify": "Cuando su solicitud esté lista recibirá otro mail de notificación para poder ver los resultados.",
      "suggestion": "Le recomendamos guardar el número de orden y agradecemos que haya confiado en PATENA."
    },
    "design": {
      "title": "Diseñar un linker",
      "stStep": "¿Qué te gustaría diseñar?",
      "ndStepLength": "Cálculo de longitud",
      "ndStepSequence": "¿Qué datos iniciales tiene?",
      "ndStepSequenceNothing": "Ninguno",
      "ndStepSequenceIS": "Secuencia Inicial",
      "ndStepSequenceFS": "Secuencias flanqueantes",
      "ndStepSequenceISFS": "Secuencia Inicial y Secuencias flanqueantes",
      "rdStepNothing": "¿Cuál es la distancia entre el aminoácido que desea vincular?",
      "rdStepAlertNothing": "Al no tener una secuencia inicial, el sistema asignará una secuencia aleatoria",
      "rdStepIS": "¿Cuál es su secuencia inicial?",
      "rdStepFS": "¿Cuáles son sus secuencias de flanqueo?",
      "rdStepDistanceFS": "Distancia",
      "rdStepCalculatedLength": "Longitud calculada",
      "rdStepISFS": "¿Cuáles son sus secuencias iniciales y de flanqueo?",
      "rdStepLabelFS1": "Secuencia flanqueante 1",
      "rdStepLabelFS2": "Secuencia flanqueante 2",
      "rdStepLabelIS": "Secuencia inicial",
      "label": "Cálculo de longitud",
      "placeholder": "Ingrese la distancia",
      "btnLinkerLength": "Longitud del Linker",
      "btnLinkerSequence": "Secuencia del Linker",
      "next": "Siguiente",
      "noInitialSequence": "-ninguna-",
      "breadcrumb": {
        "step1": "Elección del tipo de diseño",
        "step2LinkerLength": "Cálculo de longitud",
        "step2InitialData": "Elección de datos iniciales",
        "step3": "Carga de datos",
        "step4": "Configuraciones del Patena"
      }
    },
    "patenaSettings": {
      "title": "¿Qué configuración del Patena prefiere?",
      "useDefaultSettings": "Usar configuraciones por default",
      "useCustomSettings": "Usar configuraciones propias",
      "aminoAcidFrequencies": "Frecuencias de aminoácidos",
      "netCharge": "Carga neta",
      "selectNetCharge": "Seleccione dentro del rango un valor para la carga neta",
      "algorithms": "Algoritmos",
      "important": "Atención: ",
      "aminoAcidWarning": "Tenga en cuenta que todas las frecuencias deben sumar un total de 100%",
      "totalFrequency": "Frecuencia total",
      "restoreFrequencies": "Reiniciar frequencias",
      "references": "Referencias",
      "uvAminoAcidLabel": "Aminoácidos UV",
      "CLabel": "Cisteína",
      "actions": "Acciones",
      "avoidAminoAcid": "Evitar aminoácidos UV",
      "avoidCysteine": "Evitar la Cisteína",
      "netChargeWarning": "La carga neta puede tener un valor entero positivo, negativo o cero y su modulo no puede ser mayor a la longitud de la secuencia inicial.",
      "netCharge": "Carga neta (valor opcional)",
      "netChargePlaceholder": "Ingrese la carga neta",
      "algorithmWarning": "Por lo menos un algoritmos debe estar activo. Tenga en cuenta que algunos algortimos pueden demorar mucho tiempo.",
      "labelCheckNetCharge": "Quiero seleccionar una carga neta específica",
      "descriptionBlast": "El método BLAST permite evaluar la similitud entre dos secuencias\nbiológicas, tales como cadenas de aminoácidos correspondientes a prote´ınas o secuencias nucleotídicas. En nuestra herramienta utilizaremos BLAST para inferir la\nexistencia de elementos funcionales en la secuencia linker que estamos evaluando a\npartir de una similitud considerable con secuencias naturales, las cuales asumimos\nque poseen una funcionalidad biológica.",
      "descriptionIUPred": "La herramienta IUPred permite diferenciar aquellas secuencias que pueden\nformar suficientes interacciones favorables entre sus residuos, y por lo tanto podrían\nplegarse en una estructura globular, de aquellas no tienen esta capacidad y, por si\nsolas, permanecen en una conformación desordenada. Esta diferencia nos permite,\ndentro de nuestro método, identificar las posiciones de la secuencia evaluada que\ntienen una mayor tendencia a formar conformaciones globulares, una propiedad que\ndescribimos como no deseada para secuencias linker",
      "descriptionTMHMM": "Las proteínas de membrana son módulos proteícos con propiedades secuenciales\ndistintivas y que, a pesar de su diferencia con las proteínas globulares, pueden adoptar una estructura tridimensional determinada, estabilizada por interacciones con\nel contexto hidrofóbico en el que normalmente se encuentran. Teniendo en cuenta\neste panorama más amplio, utilizamos el predictor TMHMM para identificar,\ndentro de la secuencia que estamos evaluando, segmentos transmembrana ya que\nprobablemente no hayan sido detectados por otros métodos de nuestra evaluación.",
      "descriptionTango": "TANGO es un método utilizado principalmente para predecir regiones de\nagregación β, desarrollado a partir de un modelo de mecánica estadística que define\nun espacio de fases incluyendo, además de estos agregados, conformaciones de βturn, hélices-α y hebras-β. En nuestro sistema de evaluación, deseamos evitar tanto\nlas conformaciones agregadas como cualquier otra estructura ordenada, por lo tanto\nutilizaremos TANGO para detectar las posiciones que tienen tendencia a encontrarse\nformando alguna de estas conformaciones.",
      "descriptionPASTA": "En nuestra herramienta, utilizamos PASTA para identificar cuales son las\nregiones dentro de la secuencia que estamos evaluando, que podrían estabilizar una\nestructura de fibrillas amiloides. Para realizar esta predicción, el método realiza un\ncálculo de las energías de interacción entre los distintos segmentos, asumiendo que el\nmecanismo de las interacción entre aminoácidos que lleva a la formación de láminasβ en proteínas globulares es el mismo que lleva a la formación de apilamientos de\nhebras-β en fibrillas amiloides",
      "descriptionWaltz": "Utilizamos Waltz dentro de las evaluaciones de nuestra herramienta para\npredecir la tendencia de la secuencia a formar agregados amiloides. Específicamente, el método Waltz determina la tendencia a formar agregados amiloides en base a\ntres contribuciones: un componente derivado de información secuencial, un componente derivado de un conjunto de 19 propiedades fisicoquímicas, y un componente\nresultante de evaluar distintos residuos sobre un modelo estructural de la cadena\ncarbonada de fibras amiloides.",
      "descriptionProsite": "PROSITE  es un recurso que agrupa una gran cantidad de motivos secuenciales de diversas características, permitiendo anotar e identificar regiones conservadas en secuencias de proteínas. En nuestra implementación utilizamos este recurso\npara extender la búsqueda de elementos funcionales en la secuencia.",
      "descriptionELM": "El recurso de motivos lineales eucariotas (ELM) fue establecido con la\nmisión de recolectar, anotar y clasificar motivos lineales cortos (conocidos como LMs,\nELMs, SLiMs o MiniMotifs.Lo utilizaremos para\ndetectar instancias de estos elementos dentro de la secuencia linker que estamos\nevaluando, algo que, debido a las propiedades intr´ınsecas de los SLiMs, no ser´ıa\nposible sin un recurso con datos curados manualmente de la literatura y que están\ncompletamente a disposición de la comunidad cient´ıfica, como es ELM.",
      "descriptionLimbo": "El método Limbo es un predictor de sitios de unión a la chaperona DnaK,\nrepresentante de la extensa familia Hsp70, que se especializa en la unión de regiones hidrofóbicas expuestas, generalmente presentes en polipéptidos desplegados. La\nunión de chaperonas a una secuencia gobierna una gran variedad de procesos tales\ncomo translocación, replegamiento y degradación de la prote´ına reconocida, además\nde la activación de un amplio rango de prote´ınas asociadas. El objetivo de aplicar\nesta herramienta en nuestro esquema de evaluación es detectar la presencia sitios de\nunión a chaperonas en la secuencia linker, evitando el reconocimiento y la interacción\ncon proteínas en el sistema biológico de expresión o aplicación.",
      "descriptionANCHOR": "La herramienta ANCHOR busca identificar una clase especial de segmentos\ndesordenados que son capaces de experimentar un proceso de binding & folding, propio de la unión a una proteína globular. El objetivo de aplicar esta herramienta como\nparte de nuestra evaluación se debe, principalmente, a que estos procesos de reconocimiento molecular suelen estar asociados a la señalización de distintos procesos\nbiológicos, algo que destacamos como negativo para un linker ya que podría afectar\nel normal funcionamiendo del sistema biológico en el que se encuentra. De esta forma, intentamos detectar cuales son las posiciones que componen estos elementos en\nla secuencia que estamos evaluando.",
      "descriptionAmyloidPattern": "En esta etapa de la evaluación utilizaremos un patrón secuencial extraído a\npartir de evaluaciones experimentales con el fin de encontrar determinantes\nsecuenciales para la formación de fibrillas amiloides sobre la secuencia linker que\nestamos evaluando.\nEl trabajo realizado para obtener el patrón secuencial que determina la formación\nde fibrillas amiloides se basa en un experimento de mutagénesis a partir de un\npéptido formador de fibrillas amiloides diseñado de novo."
    },
    "designLengthSuccess": {
      "title": "Diseñar la longitud de un linker",
      "length": "La longitud necesaria es: ",
      "suggestion": "Gracias por utilizar PATENA.",
      "lengthUnit": " aminoácidos"
    },
    "designSuccess": {
      "title": "Diseñar un linker",
      "alertTitle": "¡Bien hecho!",
      "dataReceived": "Hemos recibido correctamente su información",
      "emailSent": "Le comentamos también que hemos enviado un mail a ",
      "emailNotSent": " El número de orden asignado fue ",
      "orderNumber": "con el siguiente número de orden ",
      "notify": "Cuando su solicitud esté lista recibirá otro mail de notificación para poder ver los resultados.",
      "suggestion": "Le recomendamos guardar el número de orden y agradecemos que haya confiado en PATENA."
    },
    "confirmationModal": {
      "title": "Confirma tu información",
      "operation": "Operación",
      "initialSequence": "Secuencia Inicial",
      "flankingSequence1": "Secuencia Flanqueante 1",
      "flankingSequence2": "Secuencia Flanqueante 2",
      "sequence": "Secuencia",
      "distance": "Distancia",
      "email": "Email",
      "btnCancel": "Cancelar",
      "btnConfirm": "Confirmar"
    },
    "settingConfirmationModal": {
      "text": "¿Está seguro de cambiar a las configuraciones por default? Si acepta, los cambios hechos en las configuraciones propias se perderán."
    },
    "footer": {
      "uba": "Es una universidad pública de investigación en Buenos Aires, Argentina. Establecida en 1821, es la principal institución de educación superior del país y en 2020 fue considerada la universidad más prestigiosa de Iberoamérica.",
      "contactInfo": "Nuestras oficinas",
      "usefulLinks": "Enlaces útiles",
      "ourLab": "Nuestro laboratorio",
      "blast": "¿Qué es BLAST?",
      "navigation": "Navegación"
    }
  }
}
